# Ex1 - Filtering and Sorting Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd 
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

### Step 3. Assign it to a variable called chipo.

In [3]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv"
chipo = pd.read_csv(url,sep="\t")
# Conversion to float
chipo.item_price = chipo.item_price.apply(lambda x: float(x[1:-1]))
# Clean Duplicated
chipo = chipo.drop_duplicates(['order_id','item_name','quantity','choice_description'])

### Step 4. How many products cost more than $10.00?

In [4]:
filter_chipo = chipo[chipo.item_price > 10]
filter_chipo.item_price.count()

np.int64(1123)

### Step 5. What is the price of each item? 
###### print a data frame with only two columns item_name and item_price

In [5]:
filter_chipo[['item_name','item_price']]

               item_name  item_price
4           Chicken Bowl       16.98
5           Chicken Bowl       10.98
7          Steak Burrito       11.75
13          Chicken Bowl       11.25
23       Chicken Burrito       10.98
...                  ...         ...
4610       Steak Burrito       11.75
4611      Veggie Burrito       11.25
4617       Steak Burrito       11.75
4618       Steak Burrito       11.75
4619  Chicken Salad Bowl       11.25

[1123 rows x 2 columns]

### Step 6. Sort by the name of the item

In [7]:
filter_chipo.sort_values(by="item_name")[['item_name','item_price']]

              item_name  item_price
3389  6 Pack Soft Drink       12.98
3547      Barbacoa Bowl       11.75
2762      Barbacoa Bowl       11.75
4380      Barbacoa Bowl       11.75
2749      Barbacoa Bowl       11.75
...                 ...         ...
1884  Veggie Salad Bowl       11.25
3223  Veggie Salad Bowl       11.25
3889  Veggie Soft Tacos       16.98
1699  Veggie Soft Tacos       11.25
738   Veggie Soft Tacos       11.25

[1123 rows x 2 columns]

### Step 7. What was the quantity of the most expensive item ordered?

In [13]:
most_expensive = filter_chipo.item_price.max()
filter_chipo[filter_chipo["item_price"] == most_expensive]#['quantity']

,order_id,quantity,item_name,choice_description,item_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25

### Step 8. How many times was a Veggie Salad Bowl ordered?

In [25]:
filter_chipo[filter_chipo['item_name'] == 'Veggie Salad Bowl']['quantity'].sum()

np.int64(10)

### Step 9. How many times did someone order more than one Canned Soda?

In [29]:
filter_chipo[filter_chipo['choice_description'] == 'Canned Soda']

Empty DataFrame
Columns: [order_id, quantity, item_name, choice_description, item_price]
Index: []